Revit 2027 API
DuctFittingAndAccessoryConnectorData.GetCoordination Method
 Gets the coordination of the connector
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetCoordination()
Public Function GetCoordination As Transform
public:
Transform^ GetCoordination()
member GetCoordination : unit -> Transform
Return Value
Transform
 The coordination of the connector
See Also
Reference
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace